GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
 memset(&DF_PicParameter,0,sizeof(DF_PicParameter));
 DF_PicParameter.FirstPic.Address=DF_CamAddress_Start;
 DF_PicParameter.LastPic.Address=DF_CamAddress_Start;
 if(printf_info)
	{
	rt_kprintf("\r\n PIC_ADDRESS,  %PIC_ID,  %PIC_LEN,  NO_DEL\r\n");
	}
 rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
 for(TempAddress=DF_CamAddress_Start;TempAddress<DF_CamAddress_End;)
 	{
 	sst25_read(TempAddress,(u8 *)&TempPackageHead,sizeof(TempPackageHead));
	if(strncmp(TempPackageHead.Head,CAM_HEAD,strlen(CAM_HEAD))==0)
		{
		DF_PicParameter.Number++;
		TempPackageInfo.Address=TempAddress;
		TempPackageInfo.Data_ID=TempPackageHead.Data_ID;
		TempPackageInfo.Len=TempPackageHead.Len;
		if(DF_PicParameter.Number==1)
			{
			DF_PicParameter.FirstPic=TempPackageInfo;
			DF_PicParameter.LastPic =TempPackageInfo;
			}
		else
			{
			if(TempPackageInfo.Data_ID>DF_PicParameter.LastPic.Data_ID)
				{
				DF_PicParameter.LastPic =TempPackageInfo;
				}
			else if(TempPackageInfo.Data_ID<DF_PicParameter.FirstPic.Data_ID)
				{
				DF_PicParameter.FirstPic=TempPackageInfo;
				}
			}
		if(printf_info)
			{
			rt_kprintf("  0x%08x,    %05d,      %04d,     %d\r\n",TempAddress,TempPackageInfo.Data_ID,TempPackageInfo.Len,TempPackageHead.State&(BIT(0)));
			}
		TempAddress+=(TempPackageInfo.Len+DF_CamSaveSect-1)/DF_CamSaveSect*DF_CamSaveSect;
		}
	else
		{
		TempAddress+=DF_CamSaveSect;
		}
 	}
 rt_sem_release(&sem_dataflash);
 if(printf_info)
 	{
 	rt_kprintf("  PIC_NUM =  %04d\r\n",DF_PicParameter.Number);
 	}
 return DF_PicParameter.Number;
}


/*********************************************************************************
*函数名称:rt_err_t Cam_Flash_WrPic(u8 *pData,u16 len, TypeDF_PackageHead *pHead)
*功能描述:向FLASH中写入图片数据，如果传递的数据的pHead->len为非0值表示为最后一包数据
*输	入:	pData:写入的数据指针，指向数据buf；
		len:数据长度，注意，该长度必须小于4096
		pHead:数据包头信息，该包头信息需要包含时间Timer，该值每次都必须传递，并且同样的包该值不能变化，
				最后一包数据需将len设置为数据长度len的长度包括包头部分，包头部分为固定64字节，其它包
				len为0.
*输	出:none 
*返 回 值:re_err_t
*作	者:白养民
*创建日期:2013-06-5
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static rt_err_t Cam_Flash_WrPic(u8 *pData,u16 len, TypeDF_PackageHead *pHead)
{
	u16 i;
	u32 temp_wr_addr;
	u32 temp_Len;
	static u8	WriteFuncUserBack=0;
	static u32	WriteAddress=0;
	static u32	WriteAddressStart=0;
	static T_TIMES	LastTime={0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
	
	u8 strBuf[256];
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	if(memcmp(&LastTime,&pHead->Time,sizeof(LastTime))!=0)
		{
		LastTime=pHead->Time;
		WriteAddressStart=(DF_PicParameter.LastPic.Address+DF_PicParameter.LastPic.Len+DF_CamSaveSect-1)/DF_CamSaveSect*DF_CamSaveSect;
		WriteAddressStart=Cam_Flash_AddrCheck(WriteAddressStart);
		WriteAddress=WriteAddressStart+64;
		if((WriteAddressStart&0xFFF)==0)
			{
			Cam_Flash_FirstPicProc(WriteAddressStart);
			}
		else
			{
			///判断该区域是否数据异常，异常需要使用falsh写函数sst25_write_back
			sst25_read(WriteAddressStart,strBuf,sizeof(strBuf));
			WriteFuncUserBack=0;
			for(i=0;i<sizeof(strBuf);i++)
				{
				if(strBuf[i]!=0xFF)
					{
					if(i<64)		///如果包头部分也错误，清空包头部分内容为0xFF
						{
						memset(strBuf,0xFF,sizeof(strBuf));
						sst25_write_back(WriteAddressStart,strBuf,sizeof(strBuf));
						}
					
					WriteFuncUserBack=1;
					break;
					}
				}
			}
		}
	
	if(WriteFuncUserBack)
		{
		if((WriteAddress&0xFFFFF000)!=((WriteAddress+len)&0xFFFFF000))		///跨越两个扇区的处理
			{
			temp_wr_addr=(WriteAddress+len)&0xFFFFF000;
			temp_Len=temp_wr_addr-WriteAddress;
			sst25_write_back(Cam_Flash_AddrCheck(WriteAddress),pData,temp_Len);
			Cam_Flash_FirstPicProc(Cam_Flash_AddrCheck(temp_wr_addr));
			sst25_write_through(Cam_Flash_AddrCheck(temp_wr_addr),pData+temp_Len,len-temp_Len);
			WriteFuncUserBack=0;
			}
		else
			{
			sst25_write_back(Cam_Flash_AddrCheck(WriteAddress),pData,len);
			}
		}
	else
		{
		if((WriteAddress&0xFFFFF000)!=((WriteAddress+len)&0xFFFFF000))		///跨越两个扇区的处理
			{
			temp_wr_addr=(WriteAddress+len)&0xFFFFF000;
			temp_Len=temp_wr_addr-WriteAddress;
			sst25_write_through(Cam_Flash_AddrCheck(WriteAddress),pData,temp_Len);
			Cam_Flash_FirstPicProc(Cam_Flash_AddrCheck(temp_wr_addr));
			sst25_write_through(Cam_Flash_AddrCheck(temp_wr_addr),pData+temp_Len,len-temp_Len);
			}
		else
			{
			sst25_write_through(Cam_Flash_AddrCheck(WriteAddress),pData,len);
			}
		}
	WriteAddress+=len;
 	if(pHead->Len)
 		{
 		WriteAddress=WriteAddressStart;
 		DF_PicParameter.Number++;
 		DF_PicParameter.LastPic.Data_ID++;
		DF_PicParameter.LastPic.Address=Cam_Flash_AddrCheck(WriteAddressStart);
		DF_PicParameter.LastPic.Len=pHead->Len;
		if(DF_PicParameter.Number==1)
			{
			DF_PicParameter.FirstPic=DF_PicParameter.LastPic;
			}
		
		memcpy(pHead->Head,CAM_HEAD,strlen(CAM_HEAD));
		pHead->Data_ID=DF_PicParameter.LastPic.Data_ID;
		pHead->Media_Style=0;
		pHead->Media_Format=0;
		sst25_write_through(Cam_Flash_AddrCheck(WriteAddressStart),(u8 *)pHead,sizeof(TypeDF_PackageHead));
 		}
	
	rt_sem_release(&sem_dataflash);
	return RT_EOK;
}



/*********************************************************************************
*函数名称:u32 Cam_Flash_FindPicID(u32 id,TypeDF_PackageHead *p_head)
*功能描述:从FLASH中查找指定ID的图片，并将图片包头新新存储在p_head中
*输	入:	id:多媒体ID号
		p_head:输出参数，输出为图片多媒体数据包头信息(类型为TypeDF_PackageHead)
*输	出:p_head 
*返 回 值:u32 0xFFFFFFFF表示没有找到图片，其它表示找到了图片，返回值为图片在flash中的地址
*作	者:白养民
*创建日期:2013-06-5
*---------------------------------------------------------------------------------
*修 改 人:bai
*修改日期:2013-06-23
*修改描述:修改了拍照数据存储异常时的检索功能
*********************************************************************************/
u32 Cam_Flash_FindPicID(u32 id,TypeDF_PackageHead *p_head)
{
	u32 i;
	u32 TempAddress;
	u32 tempu32data;
	u32 flash_search_area = 0;	///表示扫描了多少区域，当扫描区域大于图片总区域时，跳出
	
	static TypeDF_PackageInfo lastPackInfo={0xFFFFFFFF,0,0xFFFFFFFF};
	static TypeDF_PackageHead TempPackageHead;
	
	if(DF_PicParameter.Number==0)
		return 0xFFFFFFFF;
	if((id<DF_PicParameter.FirstPic.Data_ID)||(id>DF_PicParameter.LastPic.Data_ID))
		return 0xFFFFFFFF;
	if(id!=lastPackInfo.Data_ID)
		{
		lastPackInfo.Data_ID=0xFFFFFFFF;
		TempAddress=DF_PicParameter.FirstPic.Address;
		for(i=0;i<DF_PicParameter.Number;)
			{
			TempAddress=Cam_Flash_AddrCheck(TempAddress);
			sst25_read(TempAddress,(u8 *)&TempPackageHead,sizeof(TypeDF_PackageHead));
			//rt_kprintf("\r\n NUM=%d,ADDR=%d,ID=%d, Head=",i,TempAddress,TempPackageHead.Data_ID);
			//printer_data_hex((u8 *)&TempPackageHead,sizeof(TypeDF_PackageHead)-28);
			if(strncmp(TempPackageHead.Head,CAM_HEAD,strlen(CAM_HEAD))==0)
				{
				///查看该图片是否被删除
				if(TempPackageHead.State & BIT(0))
					{
					if(TempPackageHead.Data_ID==id)
						{
						lastPackInfo.Data_ID=id;
						lastPackInfo.Address=TempAddress;
						lastPackInfo.Len=TempPackageHead.Len;
						memcpy((void *)p_head,(void *)&TempPackageHead,sizeof(TypeDF_PackageHead));
						return lastPackInfo.Address;
						}
					}
				i++;
				//TempAddress+=(TempPackageHead.Len+DF_CamSaveSect-1)/DF_CamSaveSect*DF_CamSaveSect;
				tempu32data = (TempPackageHead.Len+DF_CamSaveSect-1)/DF_CamSaveSect;
				TempAddress += tempu32data * DF_CamSaveSect;
				flash_search_area += tempu32data;
				}
			else
				{
				TempAddress+=DF_CamSaveSect;		///修改存储异常，在此增加该代码，之前代码直接返回OXffff
				//return 0xFFFFFFFF;
				flash_search_area++;
				}
			if(flash_search_area > (DF_CamAddress_End-DF_CamAddress_Start)/DF_CamSaveSect)
				{
				return 0xFFFFFFFF;
				}
			}
		}
	else
		{
		memcpy((void *)p_head,(void *)&TempPackageHead,sizeof(TypeDF_PackageHead));
		return lastPackInfo.Address;
		}
	return 0xFFFFFFFF;
}


/*********************************************************************************
*函数名称:rt_err_t Cam_Flash_RdPic(void *pData,u16 *len, u32 id,u8 offset )
*功能描述:从FLASH中读取图片数据
*输	入:	pData:写入的数据指针，指向数据buf；
		len:返回的数据长度指针注意，该长度最大为512
		id:多媒体ID号
		offset:多媒体数据偏移量，从0开始，0表示读取多媒体图片包头信息，包头信息长度固定为64字节，采用
				结构体TypeDF_PackageHead格式存储
*输	出:none 
*返 回 值:re_err_t
*作	者:白养民
*创建日期:2013-06-5
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_RdPic(void *pData,u16 *len, u32 id,u8 offset )
{
	u16 i;
	u32 TempAddress;
	u32 temp_Len;
	TypeDF_PackageHead TempPackageHead;
	u8 ret;
	
