GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
	*len=0;
	//rt_kprintf("\r\n take_flash_sem");
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	
	TempAddress=Cam_Flash_FindPicID(id,&TempPackageHead);
	if(TempAddress==0xFFFFFFFF)
		{
		ret = RT_ERROR;		goto FUNC_RET;
		}
	if(TempPackageHead.Data_ID == 0xFFFFFFFF)
		{
		ret = RT_ERROR;		goto FUNC_RET;
		}
	if(offset>(TempPackageHead.Len-1)/512)
		{
		ret = RT_ENOMEM;	goto FUNC_RET;
		}
	if(offset==(TempPackageHead.Len-1)/512)
		{
		temp_Len=TempPackageHead.Len-(offset*512);
		}
	else
		{
		temp_Len=512;
		}
	sst25_read(TempAddress+offset*512,(u8 *)pData,temp_Len);
	*len=temp_Len;
	
	ret = RT_EOK;
	
	FUNC_RET:
	//rt_kprintf("\r\n releas_flash_sem");
	rt_sem_release(&sem_dataflash);
	return ret;
}



/*********************************************************************************
*函数名称:rt_err_t Cam_Flash_DelPic(u32 id)
*功能描述:从FLASH中删除图片，实际上并没有删除，而是将删除标记清0，这样下次就再也不查询该图片
*输	入:	id:多媒体ID号
*输	出:none 
*返 回 值:re_err_t
*作	者:白养民
*创建日期:2013-06-13
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_DelPic(u32 id )
{
	u32 TempAddress;
	TypeDF_PackageHead TempPackageHead;
	u8 ret;
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	TempAddress=Cam_Flash_FindPicID(id,&TempPackageHead);
	if(TempAddress==0xFFFFFFFF)
		{
		ret = RT_ERROR;		goto FUNC_RET;
		}
	TempPackageHead.State &= ~(BIT(0));
	sst25_write_through(TempAddress,(u8 *)&TempPackageHead,sizeof(TypeDF_PackageHead));
	ret = RT_EOK;
	
	FUNC_RET:
	rt_sem_release(&sem_dataflash);
	return ret;
}

/*********************************************************************************
*函数名称:rt_err_t Cam_Flash_TransOkSet(u32 id)
*功能描述:将该ID的图片标记为发送成功
*输	入:	id:多媒体ID号
*输	出:none 
*返 回 值:re_err_t
*作	者:白养民
*创建日期:2013-06-13
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_TransOkSet(u32 id )
{
	u32 TempAddress;
	TypeDF_PackageHead TempPackageHead;
	u8 ret;
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	TempAddress=Cam_Flash_FindPicID(id,&TempPackageHead);
	if(TempAddress==0xFFFFFFFF)
		{
		ret = RT_ERROR;		goto FUNC_RET;
		}
	TempPackageHead.State &= ~(BIT(1));
	sst25_write_through(TempAddress,(u8 *)&TempPackageHead,sizeof(TypeDF_PackageHead));
	ret = RT_EOK;
	
	FUNC_RET:
	rt_sem_release(&sem_dataflash);
	return ret;
}


/*********************************************************************************
*函数名称:u16 Cam_Flash_SearchPic(T_TIMES *start_time,T_TIMES *end_time,Style_Cam_Requset_Para *para,u8 *psrc)
*功能描述:从FLASH中查找指定时间段的图片索引
*输	入:	start_time	开始时间，
		end_time		结束时间，
		para			查找图片的属性
		para			存储查找到得图片的位置，
*输	出: u16 类型，表示查找到得图片数量 
*返 回 值:re_err_t
*作	者:白养民
*创建日期:2013-06-5
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u16 Cam_Flash_SearchPic(T_TIMES *start_time,T_TIMES *end_time,TypeDF_PackageHead *para,u8 *pdest)
{
	u16 i;
	u32 TempAddress;
	u32 temp_u32;
	u32 temp_Len;
	TypeDF_PackageHead TempPackageHead;
	u16 ret_num=0;
	
	if(DF_PicParameter.Number==0)
		return 0;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	TempAddress=DF_PicParameter.FirstPic.Address;
	for(i=0;i<DF_PicParameter.Number;i++)
		{
		TempAddress=Cam_Flash_AddrCheck(TempAddress);
		sst25_read(TempAddress,(u8 *)&TempPackageHead,sizeof(TempPackageHead));
		if(strncmp(TempPackageHead.Head,CAM_HEAD,strlen(CAM_HEAD))==0)
			{
			///查看该图片是否被删除
			if(TempPackageHead.State & BIT(0))
				{
				///比较多媒体类型，多媒体通道，多媒体触发源
				if((TempPackageHead.Media_Style==para->Media_Style)&&((TempPackageHead.Channel_ID==para->Channel_ID)||(para->Channel_ID==0))&&((TempPackageHead.TiggerStyle==para->TiggerStyle)||(para->TiggerStyle==0xFF)))
					{
					temp_u32=Times_To_LongInt(&TempPackageHead.Time);
					///比较时间是否在范围
					if((temp_u32>Times_To_LongInt(start_time))&&(temp_u32<=Times_To_LongInt(end_time)))
						{
						///找到了数据
						data_to_buf(pdest,TempAddress,4);
						//memcpy(pdest,&TempAddress,4);
						pdest+=4;
						ret_num++;
						}
					}
				}
			TempAddress += (TempPackageHead.Len+DF_CamSaveSect-1)/DF_CamSaveSect*DF_CamSaveSect;
			}
		else
			{
			TempAddress += DF_CamSaveSect;		///修改存储异常，在此增加该代码，之前代码直接返回OXffff
			}
		}
	
	rt_sem_release(&sem_dataflash);
	return ret_num;
}

/*********************************************************************************
*函数名称:static rt_err_t Cam_Device_open( void )
*功能描述:打开模块供电
*输	入:none
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static rt_err_t Cam_Device_open( void )
{
	Power_485CH1_ON;
	return RT_EOK;
}


/*********************************************************************************
*函数名称:static rt_err_t Cam_Devic_close( void )
*功能描述:关闭模块供电
*输	入:none
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static rt_err_t Cam_Devic_close( void )
{
	Power_485CH1_OFF;
	return RT_EOK;
}




/*********************************************************************************
*函数名称:void Cam_Device_init( void )
*功能描述:初始化CAM模块相关接口
*输	入:none
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void Cam_Device_init( void )
{
	GPIO_InitTypeDef	GPIO_InitStructure;
	///开电
	Power_485CH1_ON;

	///初始化消息队列
	rt_mq_init( &mq_Cam, "mq_cam", &msgpool_cam[0], sizeof(Style_Cam_Requset_Para), sizeof(msgpool_cam), RT_IPC_FLAG_FIFO );

	///初始化flash参数
	Cam_Flash_InitPara(0);

	///初始化照相状态参数
	memset((u8 *)&Current_Cam_Para,0,sizeof(Current_Cam_Para));
	Current_Cam_Para.State=CAM_NONE;
}

/*********************************************************************************
*函数名称:static void Cam_Start_Cmd(u16 Cam_ID)
*功能描述:向camera模块发送开始拍照指令
*输	入:Cam_ID	需要拍照的camera设备ID
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static void Cam_Start_Cmd(u16 Cam_ID)
{
 	u8 Take_photo[10]= { 0x40, 0x40, 0x61, 0x81, 0x02, 0X00, 0X00, 0X02, 0X0D, 0X0A };	 //----  报警拍照命令
 	Take_photo[4]=(u8)Cam_ID;
 	Take_photo[5]=(u8)(Cam_ID>>8);
	RS485_write(Take_photo,10);
	uart2_rxbuf_rd=uart2_rxbuf_wr;
	rt_kprintf("\r\n发送拍照命令");
}

/*********************************************************************************
*函数名称:static void Cam_Read_Cmd(u16 Cam_ID)
*功能描述:向camera模块发送读取照片数据指令
*输	入:Cam_ID	需要拍照的camera设备ID
*输	出:none 
*返 回 值:none
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
static void Cam_Read_Cmd(u16 Cam_ID)
{
	uint8_t Fectch_photo[10] = { 0x40, 0x40, 0x62, 0x81, 0x02, 0X00, 0XFF, 0XFF, 0X0D, 0X0A };  //----- 报警取图命令
	Fectch_photo[4]=(u8)Cam_ID;
 	Fectch_photo[5]=(u8)(Cam_ID>>8);
	RS485_write(Fectch_photo,10);
	uart2_rxbuf_rd=uart2_rxbuf_wr;
	rt_kprintf("\r\n读取照片命令");
}

/*********************************************************************************
*函数名称:TypeDF_PICPara Cam_get_state(void)
*功能描述:获取系统拍照相关参数
*输	入:none
*输	出:none 
*返 回 值:TypeDF_PICPara
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
TypeDF_PICPara Cam_get_state(void)
{
	return DF_PicParameter;
}


void cam_wr_flash(u32 addr,char *psrc)
{
	char pstr[128];
	memset(pstr,0,sizeof(pstr));
	memcpy(pstr,psrc,strlen(psrc));
	sst25_write_back(addr,pstr,strlen(pstr)+1);
}
FINSH_FUNCTION_EXPORT( cam_wr_flash, cam_wr_flash );


void cam_wr_flash_ex(u32 addr,char *psrc)
{
	char pstr[128];
	memset(pstr,0,sizeof(pstr));
	memcpy(pstr,psrc,strlen(psrc));
	sst25_erase_4k(addr);
	sst25_write_through(addr,pstr,strlen(pstr)+1);
}
FINSH_FUNCTION_EXPORT( cam_wr_flash_ex, cam_wr_flash_ex );

/*********************************************************************************
*函数名称:rt_err_t take_pic_request( Style_Cam_Requset_Para *para)
*功能描述:请求拍照指令
*输	入:para拍照参数
*输	出:none 
*返 回 值:rt_err_t
*作	者:白养民
*创建日期:2013-06-3
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
rt_err_t take_pic_request( Style_Cam_Requset_Para *para)
{
 return rt_mq_send(&mq_Cam,(void *) para,sizeof(Style_Cam_Requset_Para));
}



